package com.example.hscictquiz;

import android.annotation.SuppressLint;
import android.os.Bundle;
import android.widget.TextView;

import androidx.activity.EdgeToEdge;
import androidx.appcompat.app.AppCompatActivity;
import androidx.core.graphics.Insets;
import androidx.core.view.ViewCompat;
import androidx.core.view.WindowInsetsCompat;

public class Activity16 extends AppCompatActivity {

    private String[] questions = {
            "1. তথ্য ও যোগাযোগ প্রযুক্তির বিকাশে কোন প্রযুক্তি সবচেয়ে গুরুত্বপূর্ণ ভূমিকা পালন করেছে?\nউত্তর: কম্পিউটার",

            "2. টেলিযোগাযোগের মাধ্যমে সভা আয়োজনকে কী বলা হয়?\nউত্তর: টেলিকনফারেন্স",

            "3. রোগী দূরের চিকিৎসকের কাছ থেকে সেবা কিভাবে নিতে পারে?\nউত্তর: ভিডিও কনফারেন্স",

            "4. সাম্প্রতিক সময়ে কোন প্রযুক্তির ব্যাপক ব্যবহার বৃদ্ধি পেয়েছে?\nউত্তর: ইন্টারনেট",

            "5. তথ্য প্রযুক্তি কী বোঝায়?\nউত্তর: তথ্য সংরক্ষণ এবং ব্যবহার করার প্রযুক্তি",

            "6. স্কাইপি কী?\nউত্তর: ভিডিও চ্যাটিং সেবা",

            "7. বর্তমান সময়ে আধুনিক যোগাযোগ এবং সম্প্রচার ব্যবস্থা কী দ্বারা পরিচালিত হয়?\nউত্তর: স্যাটেলাইট",

            "8. টেলিভিশন কী ধরনের যোগাযোগ ব্যবস্থা?\nউত্তর: একমুখী যোগাযোগ ব্যবস্থা",

            "9. কোন প্রযুক্তি ব্যবহার করে দূরের স্থান থেকে মিটিংয়ে অংশগ্রহণ করা সম্ভব?\nউত্তর: টেলিকনফারেন্সিং",

            "10. কোন আবিষ্কার যোগাযোগ ব্যবস্থায় বিপ্লব ঘটিয়েছে?\nউত্তর: টেলিফোন",

            "11. তথ্য ও যোগাযোগ প্রযুক্তি (ICT) কীভাবে খরচ কমায়?\nউত্তর: অপচয় কমিয়ে",

            "12. ভিডিও কনফারেন্সিংয়ে অংশগ্রহণকারীরা কী করতে পারে?\nউত্তর: (একেকটি দেখতে পায়, কথা শুনতে পায়, চিঠিপত্র আদান-প্রদান করতে পারে)",

            "13. চাকুরিজীবীদের কাছে ইন্টারনেট কেন জনপ্রিয়?\nউত্তর: (যাতায়াত খরচ কমে, অতিরিক্ত আয় করা যায়, সময় সাশ্রয় হয়)",

            "14. বিশ্বগ্রাম ধারণার সৃষ্টিকর্তা কে?\nউত্তর: মার্শাল ম্যাকলুহান",

            "15. ইন্টারনেটের মাধ্যমে ঘরে বসে কাজ করার সুযোগকে কী বলা হয়?\nউত্তর: আউটসোর্সিং",

            "16. ফ্রিল্যান্সিং কী?\nউত্তর: স্বাধীনভাবে কাজ করা",

            "17. গ্লোবাল ভিলেজ প্রতিষ্ঠায় কোন উপাদানের ভূমিকা সবচেয়ে বড়?\nউত্তর: ইন্টারনেট",

            "18. বিশ্বগ্রাম ধারণার সাথে কী বিষয়টি সম্পর্কিত?\nউত্তর: ইন্টারনেটের ব্যাপক ব্যবহার",

            "19. ঘরে বসে কাজের সুযোগ ইন্টারনেটের মাধ্যমে কী বলা হয়?\nউত্তর: আউটসোর্সিং",

            "20. ফ্রিল্যান্সিং কি ধরনের কাজ?\nউত্তর: স্বাধীনভাবে কাজ করা",

            "21. গ্লোবাল ভিলেজ গড়ার ক্ষেত্রে কোন উপাদান সবচেয়ে বেশি সাহায্য করে?\nউত্তর: ইন্টারনেট",

            "22. বিশ্বগ্রামের ধারণা কী বিষয়ে সবচেয়ে বেশি প্রভাবিত?\nউত্তর: ইন্টারনেটের সহজলভ্যতা",

            "23. বিশ্বব্যাপী বিজ্ঞাপন ছড়িয়ে দিতে কী করতে হবে?\nউত্তর: ওয়েবসাইটে প্রকাশ করতে হবে",

            "24. হার্বার্ট মার্শাল ম্যাকলুহান কোন দেশের নাগরিক ছিলেন?\nউত্তর: কানাডা",

            "25. বিশ্বগ্রামের ভিত্তি কী?\nউত্তর: কানেকটিভিটি",

            "26. কোন মাধ্যমে এক দেশ থেকে অন্য দেশে ভিডিও চ্যাট করা সম্ভব?\nউত্তর: স্কাইপি",

            "27. ইন্টারনেটের মাধ্যমে ব্যবসা পরিচালনাকে কী বলা হয়?\nউত্তর: ই-কমার্স",

            "28. www.khanacademy.org কী ধরনের ওয়েবসাইট?\nউত্তর: শিক্ষা সম্পর্কিত ওয়েবসাইট",

            "29. আউটসোর্সিং কী?\nউত্তর: ইন্টারনেটভিত্তিক কাজ",

            "30. কোন প্রযুক্তির মাধ্যমে ঘরে বসে বিশ্বকে হাতের মুঠোয় পাওয়া যাচ্ছে?\nউত্তর: ইন্টারনেট",

            "31. দূরের কোন ব্যক্তির সাথে যোগাযোগ করতে কোন প্রযুক্তি প্রয়োজন হয়?\nউত্তর: ইন্টারনেট",

            "32. সবচেয়ে জনপ্রিয় সামাজিক যোগাযোগ মাধ্যম কোনটি?\nউত্তর: ক. Facebook",

            "33. দেশের অর্থনীতিকে শক্তিশালী করার জন্য কোনটি নতুন মাত্রা যুক্ত করেছে?\nউত্তর: আউটসোর্সিং",

            "34. অর্থ প্রেরণ এবং গ্রহণের জন্য কোন মাধ্যমটি নিরাপদ ও জনপ্রিয় হয়ে উঠেছে?\nউত্তর: মোবাইল ব্যাংকিং",

            "35. ই-কমার্স এর মধ্যে কোনটি অন্তর্ভুক্ত নয়?\nউত্তর: প্রচার",

            "36. প্লেজিয়ারিজম কোন অপরাধের সঙ্গে সম্পর্কিত?\nউত্তর: কপিরাইট লঙ্ঘন",

            "37. অনুমতি ছাড়া কোন কম্পিউটার নেটওয়ার্কে প্রবেশ করা কী নামে পরিচিত?\nউত্তর: হ্যাকিং",

            "38. কোনটি আউটসোর্সিংয়ের কাজের বাজার?\nউত্তর: ওডেস্ক",

            "39. গ্লোবাল ভিলেজের ধারণায় সবচেয়ে গুরুত্বপূর্ণ উপাদান কোনটি?\nউত্তর: ইন্টারনেট",

            "40. ইন্টারনেটের মাধ্যমে ব্যবসা পরিচালনাকে কী বলা হয়?\nউত্তর: ই-কমার্স",

            "41. ইন্টারনেট ব্যবহার করে কর্মসংস্থানের সুযোগ কীভাবে পরিচিত?\nউত্তর: আউটসোর্সিং",

            "42. বিশ্বগ্রাম বলতে কী বোঝায়?\nউত্তর: বিশ্বের গ্রামগুলোর একে অপরের সাথে সম্পর্ক",

            "43. হার্বার্ট মার্শাল ম্যাকলুহান এর কোন গ্রন্থটি বিখ্যাত?\nউত্তর: The Gutenberg Galaxy: The Making of Typographic Man",

            "44. বিশ্বগ্রাম গঠনের জন্য প্রয়োজনীয় উপাদান কী?\nউত্তর: (কানেকটিভিটি ও ডেটা)",

            "45. দূরশিক্ষণ পদ্ধতির মাধ্যমে ছাত্ররা কী কী করতে পারে?\nউত্তর: (বাড়ির কাজ ইন্টারনেটের মাধ্যমে জমা দিতে পারে, বিভিন্ন অনলাইন পরীক্ষায় অংশগ্রহণ করতে পারে, শিক্ষকের লেকচার নোট ওয়েবসাইটে দেখতে পারে)",

            "46. অনলাইন শিক্ষা ব্যবস্থায় শিশু শ্রেণির শিক্ষাদানে কোন মাধ্যমে লেকচার প্রচার করা যেতে পারে?\nউত্তর: (টেলিভিশন ও মোবাইল ফোনের মাধ্যমে)",

            "47. আমাদের দেশে প্রচলিত শিক্ষাব্যবস্থার পাশাপাশি নতুন শিক্ষাব্যবস্থা কী?\nউত্তর: (ওয়েবভিত্তিক ও ইন্টারনেটভিত্তিক)",

            "48. ই-কমার্স এর সাথে সম্পর্কিত শব্দ কোনটি?\nউত্তর: ক্রেডিট কার্ড",

            "49. গ্লোবাল ভিলেজ প্রতিষ্ঠার প্রেক্ষাপটে একটি অফিস মিটিংয়ের জন্য কোন উপাদানগুলো প্রয়োজন হতে পারে?\nউত্তর: (ভিডিও কনফারেন্সিং সফটওয়্যার, অডিও কনফারেন্সিং সফটওয়্যার, সিমুলেশন সফটওয়্যার)",

            "50. বর্তমানে কর্মস্থলের জন্য কী সুবিধা পাওয়া যাচ্ছে?\nউত্তর: (ঘরে বসে কাজ, ইন্টারনেট সুবিধা, বিভিন্ন ওয়েব সুবিধা)",

            "51. যে বিজ্ঞাননির্ভর কল্পনা বাস্তব নয় কিন্তু বাস্তবের মতো অনুভূতি সৃষ্টি করে তাকে কী বলা হয়?\nউত্তর: ভার্চুয়াল রিয়েলিটি",

            "52. ভার্চুয়াল রিয়েলিটি কী তত্ত্বের উপর প্রতিষ্ঠিত?\nউত্তর: সিমুলেশন তত্ত্ব",

            "53. ভার্চুয়াল রিয়েলিটির বৈশিষ্ট্য কী?\nউত্তর: কাল্পনিক জগতে বিচরণ",

            "54. ভার্চুয়াল রিয়েলিটির জন্য ব্যবহৃত যন্ত্রাংশ কী?\nউত্তর: ডেটা গ্লাভ",

            "55. সাধারণত ভার্চুয়াল রিয়েলিটির পরিবেশ কেমন হয়?\nউত্তর: ত্রিমাত্রিক",

            "56. কম্পিউটার সিমুলেশন কোন ক্ষেত্রে প্রয়োগ করা হয়?\nউত্তর: ভার্চুয়াল রিয়েলিটি",

            "57. ভার্চুয়াল রিয়েলিটিতে কোন প্রযুক্তি ব্যবহৃত হয়?\nউত্তর: ত্রিমাত্রিক সিমুলেশন",

            "58. সিমুলেশনে যখন কোন কিছুর শারীরিক উপস্থিতি তৈরি করা হয়, তাকে কী বলা হয়?\nউত্তর: ভার্চুয়াল রিয়েলিটি",

            "59. নিচের কোনটি ভার্চুয়াল রিয়েলিটি তৈরি করতে ব্যবহৃত হয়?\nউত্তর: কৃত্রিম বাস্তব জগত",

            "60. ভার্চুয়াল রিয়েলিটিতে জীবন্ত ছবি প্রদর্শনের জন্য কোন প্রযুক্তি ব্যবহার করা হয়?\nউত্তর: ত্রিমাত্রিক",
            "61. ভার্চুয়াল রিয়েলিটির মাধ্যমে সামরিক প্রশিক্ষণ দিতে কি সুবিধা হয়?\nউত্তর: প্রাণহানির সম্ভাবনা কমে যায়",

            "62. ভার্চুয়াল রিয়েলিটি অভিজ্ঞতা লাভ করতে কী কী সরঞ্জাম পরিধান করতে হয়?\nউত্তর: (বিশেষ হেলমেট, গ্লোভস ও বিশেষ জুতো পরতে হয়)",

            "63. ভার্চুয়াল রিয়েলিটি ব্যবহারের কারণে মানুষের কী প্রভাব পড়তে পারে?\nউত্তর: বাস্তবতা থেকে বিচ্যুত হতে পারে",

            "64. কৃত্রিম উপায়ে মানুষের চিন্তা ও মেধাকে কম্পিউটারে রূপান্তরিত করার প্রযুক্তিকে কী বলা হয়?\nউত্তর: কৃত্রিম বুদ্ধিমত্তা",

            "65. কৃত্রিম বুদ্ধিমত্তা প্রথম কোন প্রজন্মের কম্পিউটার ব্যবস্থায় সংযুক্ত করা হয়েছিল?\nউত্তর: পঞ্চম প্রজন্ম",

            "66. কৃত্রিম বুদ্ধিমত্তা মূলত কোথায় ব্যবহৃত হয়?\nউত্তর: রোবটিক্স",

            "67. 'আর্টিফিশিয়াল ইন্টেলিজেন্স' (AI) ধারণাটি প্রথম কোন বিজ্ঞানী উপস্থাপন করেন?\nউত্তর: জন ম্যাককার্থি",

            "68. এক্সপার্ট সিস্টেম কী?\nউত্তর: বিশেষজ্ঞদের মতামত ভিত্তিক সফটওয়্যার",

            "69. কৃত্রিম বুদ্ধিমত্তার একটি গুরুত্বপূর্ণ শাখা কী?\nউত্তর: মেশিন লার্নিং",

            "70. মেশিন লার্নিং কী?\nউত্তর: যন্ত্রকে শেখানো এবং সিদ্ধান্ত নেওয়ার ক্ষমতা অর্জন",

            "71. কৃত্রিম বুদ্ধিমত্তা ব্যবহার করে একটি রোবট কী কাজ করতে পারে?\nউত্তর: স্বতঃস্ফূর্তভাবে কাজ সম্পাদন",

            "72. রোবটের কাজের পদ্ধতি কী ভিত্তিতে নির্ধারণ করা হয়?\nউত্তর: কৃত্রিম বুদ্ধিমত্তা",

            "73. কৃত্রিম বুদ্ধিমত্তা কোথায় ব্যবহৃত হয়?\nউত্তর: গাড়ি চালনা, স্বাস্থ্যসেবা, খুচরা ব্যবসায়",

            "74. কৃত্রিম বুদ্ধিমত্তা ব্যবহারের প্রধান উদ্দেশ্য কী?\nউত্তর: মানুষের কাজের গতি ও দক্ষতা বৃদ্ধি",

            "75. মেশিন লার্নিং এর একটি উদাহরণ কী?\nউত্তর: চ্যাটবট",

            "76. রোবটিক্স কী?\nউত্তর: রোবট তৈরি এবং নিয়ন্ত্রণের বিজ্ঞান",

            "77. রোবট কি স্বয়ংক্রিয়ভাবে কাজ করতে পারে?\nউত্তর: হ্যাঁ, কৃত্রিম বুদ্ধিমত্তার সাহায্যে",

            "78. কৃত্রিম বুদ্ধিমত্তার মাধ্যমে রোবটের কাজ কীভাবে উন্নত করা হয়?\nউত্তর: অ্যালগরিদমের সাহায্যে",

            "79. কৃত্রিম বুদ্ধিমত্তার অন্যতম উদাহরণ কোনটি?\nউত্তর: অ্যালেক্সা",

            "80. কৃত্রিম বুদ্ধিমত্তার মূল উপাদান কী?\nউত্তর: ডেটা এবং অ্যালগরিদম",

            "81. কৃত্রিম বুদ্ধিমত্তা ব্যবহারের ফলে মানব সমাজে কী পরিবর্তন ঘটেছে?\nউত্তর: প্রযুক্তির উন্নতি এবং কর্মসংস্থানের সুযোগ বৃদ্ধি",

            "82. কৃত্রিম বুদ্ধিমত্তার বিকাশের ফলে কী ফলাফল হতে পারে?\nউত্তর: নতুন উদ্ভাবন এবং মানবজাতির সেবা বৃদ্ধি",

            "83. নিচের কোনটি কম্পিউটারের অন্তর্গত নয়?\nউত্তর: নিজস্ব বুদ্ধিমত্তা",

            "84. কৃত্রিম বুদ্ধিমত্তা পদ্ধতির প্রয়োগ কোথায় রয়েছে?\nউত্তর: সূত্রের প্রতিপাদন এবং সমস্যা সমাধানে",

            "85. কৃত্রিম বুদ্ধিমত্তা ব্যবহারের প্রধান ক্ষেত্র কী?\nউত্তর: বুদ্ধিবৃত্তিক বিজ্ঞান",

            "86. কৃত্রিম বুদ্ধিমত্তা তৈরির জন্য কম্পিউটার কী কী ব্যবহার করে?\nউত্তর: ইলেকট্রনিক চিপ এবং উচ্চক্ষমতাসম্পন্ন মাইক্রোপ্রসেসর",

            "87. মাইশার কম্পিউটারে দাবা খেলার প্রোগ্রামটি কী ভিত্তিতে তৈরি?\nউত্তর: কৃত্রিম বুদ্ধিমত্তা",

            "88. মাইশার দাবা খেলোয়াড়ের বিপরীতে কম্পিউটার কখনও ভুল করে, কেন?\nউত্তর: কৃত্রিম বুদ্ধিমত্তায় তথ্য ও অভিজ্ঞতার ভিত্তিতে সিদ্ধান্ত গ্রহণ হয়, এবং লার্নিং সিস্টেম ভূমিকা রাখে",

            "89. রোবটিক্স কী?\nউত্তর: রোবট তৈরি এবং নিয়ন্ত্রণের বিজ্ঞান",

            "90. নিচের কোনটি রোবটের অর্থ প্রকাশ করে?\nউত্তর: যন্ত্রমানব",

            "91. কোনটির নিজস্ব বুদ্ধিমত্তা নেই?\nউত্তর: রোবট",

            "92. অ্যাকচুয়েটর কী ক্ষেত্রে ব্যবহৃত হয়?\nউত্তর: রোবটিক্স",

            "93. রোবটের ব্যবহারের একটি উদাহরণ কী?\nউত্তর: জটিল সার্জারি চিকিৎসায়",

            "94. রোবটিক্সে সাধারণত কী কী বিষয় ব্যবহৃত হয়?\nউত্তর: কৃত্রিম বুদ্ধিমত্তা, ইঞ্জিনিয়ারিং, মনোবিজ্ঞান",

            "95. রোবট শব্দটি কোন ভাষা থেকে এসেছে?\nউত্তর: স্লাভিক",

            "96. নাসা যে রোবটটি মঙ্গলগ্রহে পাঠিয়েছিল তার নাম কী?\nউত্তর: কিউরিওসিটি",

            "97. প্রথম কোন সায়েন্স ফিকশন লেখক 'রোবটিক্স' শব্দটি ব্যবহার করেন?\nউত্তর: আইজ্যাক আসিমভ",

            "98. মানুষের কঠিন কাজের প্রযুক্তি কোনটি?\nউত্তর: কৃত্রিম বুদ্ধিমত্তা",

            "99. কোন পদ্ধতিতে অ্যাকচুয়েটর ব্যবহৃত হয়?\nউত্তর: রোবটিক্স",

            "100. 'Cryo' শব্দের অর্থ কী?\nউত্তর: বরফের মতো ঠান্ডা",
            "101. অত্যধিক ঠান্ডায় রোগাক্রান্ত বা ক্ষতিগ্রস্ত টিস্যুর উপর কোন চিকিৎসা পদ্ধতি প্রয়োগ করা হয়?\nউত্তর: ক্রায়োসার্জারি",

            "102. কত তাপমাত্রায় ক্রায়োসার্জারি কোষগুলো ধ্বংস করতে সাহায্য করে?\nউত্তর: -১৯°C",

            "103. ক্রায়োসার্জারির সঙ্গে কোন উপাদান সম্পর্কিত?\nউত্তর: তরল নাইট্রোজেন",

            "104. কোন রোগের চিকিৎসায় ক্রায়োসার্জারি ব্যবহৃত হয়?\nউত্তর: ত্বক সংক্রান্ত রোগ",

            "105. কোন সার্জিক্যাল পদ্ধতিতে টিউমারকে অত্যন্ত ঠান্ডা তাপমাত্রায় ধ্বংস করা হয়?\nউত্তর: ক্রায়োসার্জারি",

            "106. ক্রায়োসার্জারি কোন রোগে ব্যবহৃত হয়?\nউত্তর: লিভার ক্যান্সার",

            "107. ক্রায়োগ্রো’ কী?\nউত্তর: ক্রায়োসার্জারিতে ব্যবহৃত বিশেষ ধাতুর পেন্সিল-আকৃতির যন্ত্র",

            "108. ক্রায়োসার্জারি চিকিৎসায় এমআরআই কেন ব্যবহার করা হয়?\nউত্তর: আক্রান্ত কোষের সঠিক অবস্থান নির্ণয়ের জন্য",

            "109. ক্রায়োসার্জারিতে নাইট্রোজেনের কোন অবস্থা ব্যবহৃত হয়?\nউত্তর: কঠিন অবস্থা",

            "110. 'কিউরিসিটি' নামক মহাকাশযান কোথায় পাঠানো হয়েছে?\nউত্তর: মঙ্গলগ্রহে",

            "111. কোন কক্ষপথে আন্তর্জাতিক মহাকাশ স্টেশন স্থাপিত হয়েছে?\nউত্তর: পৃথিবীর কক্ষপথে",

            "112. চন্দ্রে অবতরণকারী প্রথম মনুষ্যবাহী মহাকাশযানের নাম কী?\nউত্তর: অ্যাপোলো-১১",

            "113. মহাকাশে প্রথম কোন প্রাণী পাঠানো হয়েছিল?\nউত্তর: লাইকা (কুকুর)",

            "114. মহাকাশযানে প্রথম নারী হিসেবে কোন ব্যক্তি গমন করেছিলেন?\nউত্তর: ভ্যালেনটিনা তেরেশকোভা",

            "115. প্রথম চন্দ্রযান কোন বছর পৃথিবী থেকে উৎক্ষেপিত হয়?\nউত্তর: ১৯৫৯ সালে",

            "116. পৃথিবী থেকে মঙ্গলগ্রহের গড় দূরত্ব কত?\nউত্তর: প্রায় ৫৫ মিলিয়ন কিলোমিটার",

            "117. পৃথিবী থেকে চন্দ্রযানের গড় দূরত্ব কত?\nউত্তর: প্রায় ৩৮৪,৪০০ কিলোমিটার",

            "118. মানুষ প্রথম চন্দ্রে অবতরণ করে কোন বছরে?\nউত্তর: ১৯৬৯ সালে",

            "119. পৃথিবী থেকে মঙ্গলগ্রহের উদ্দেশে যাত্রা করতে কত সময় লাগে?\nউত্তর: প্রায় ৯ মাস",

            "120. পৃথিবী থেকে মহাকাশযান উৎক্ষেপণের জন্য ব্যবহৃত রকেটের নাম কী?\nউত্তর: স্যাটার্ন-৫",

            "121. মহাকাশ গবেষণার জন্য প্রথম মহাকাশ কেন্দ্রের নাম কী?\nউত্তর: কিসলিভস্কি মহাকাশ কেন্দ্র",

            "122. মঙ্গলগ্রহে প্রথম যাত্রা করা রোবট মহাকাশযানের নাম কী?\nউত্তর: মার্স রোভার",

            "123. প্রথম রোবট মহাকাশযানটি কোথায় অবতরণ করে?\nউত্তর: মঙ্গলগ্রহে",

            "124. পৃথিবীতে মহাকাশ গবেষণার জন্য কোন সংস্থা প্রতিষ্ঠিত হয়েছে?\nউত্তর: NASA (ন্যাশনাল অ্যারোনটিকস অ্যান্ড স্পেস অ্যাডমিনিস্ট্রেশন)",

            "125. সোভিয়েত ইউনিয়নের প্রথম মহাকাশযানের নাম কী?\nউত্তর: স্পুটনিক-১",

            "126. আন্তর্জাতিক মহাকাশ স্টেশন (ISS) কবে চালু হয়?\nউত্তর: ১৯৯৮ সালে",

            "127. পৃথিবী থেকে প্রথম কৃত্রিম উপগ্রহ উৎক্ষেপণ করেছে কোন দেশ?\nউত্তর: সোভিয়েত ইউনিয়ন",

            "128. পৃথিবীর কক্ষপথে প্রথম কৃত্রিম উপগ্রহটি কবে উৎক্ষেপিত হয়?\nউত্তর: ১৯৫৭ সালে",

            "129. 'স্পেস এক্স' কে প্রতিষ্ঠা করেন?\nউত্তর: ইলন মাস্ক",

            "130. মহাকাশ গবেষণার জন্য প্রথম প্রজন্মের টেলিস্কোপ কী?\nউত্তর: হাবল টেলিস্কোপ",

            "131. মহাকাশে প্রথম চন্দ্রযান কোন দেশ পাঠিয়েছিল?\nউত্তর: সোভিয়েত ইউনিয়ন",

            "132. পৃথিবী থেকে মহাকাশে যাত্রা করার জন্য প্রথম রকেট কবে উৎক্ষেপিত হয়?\nউত্তর: ১৯৪৪ সালে",

            "133. মহাকাশের সেরা তত্ত্ব কোনটি?\nউত্তর: সাধারণ আপেক্ষিকতা",

            "134. প্রথম মহাকাশযানটি কোন দেশে তৈরি হয়?\nউত্তর: সোভিয়েত ইউনিয়নে",

            "135. 'ব্ল্যাক হোল' কী?\nউত্তর: একটি স্থান যেখানে মহাকর্ষ শক্তি এত বেশি যে সেখান থেকে কোন কিছুই বের হতে পারে না",

            "136. মহাকাশযান কোন শক্তি দ্বারা চালিত হয়?\nউত্তর: রকেট ইঞ্জিন শক্তি",

            "137. পৃথিবী থেকে প্রথম রোবট মহাকাশযান কোথায় পাঠানো হয়?\nউত্তর: মঙ্গলগ্রহে",

            "138. 'কিউরিসিটি' নামক মহাকাশযান কোথায় পাঠানো হয়েছিল?\nউত্তর: মঙ্গলগ্রহে",

            "139. আন্তর্জাতিক মহাকাশ স্টেশন কোথায় স্থাপিত?\nউত্তর: পৃথিবীর কক্ষপথে",

            "140. প্রথম চন্দ্রে অবতরণকারী মনুষ্যবাহী মহাকাশযানের নাম কী?\nউত্তর: অ্যাপোলো-১১",

            "141. 'ক্যাড' কী বোঝায়?\nউত্তর: কম্পিউটার সাহায্যে ডিজাইন তৈরি করার প্রক্রিয়া।",

            "142. নতুন পণ্য ডিজাইন তৈরির জন্য কোন সফটওয়্যার প্রয়োজন?\nউত্তর: CAD সফটওয়্যার।",

            "143. কোনটি আইসিটি এবং আইটি'র মধ্যে পার্থক্য চিহ্নিত করে?\nউত্তর: টেলিযোগাযোগের নির্ভরতা।",

            "144. CAD সফটওয়্যার দ্বারা সাধারণত কোন ধরনের ডিজাইন তৈরি করা হয়?\nউত্তর: কম্পিউটার-জেনারেটেড টেকনিক্যাল ডিজাইন।",

            "145. আইসিটি এবং আইটি'র মধ্যে পার্থক্য চিহ্নিতকারী বৈশিষ্ট্য কী?\nউত্তর: টেলিযোগাযোগ নির্ভর।",

            "146. বায়োমেট্রিক প্রযুক্তি কোথায় ব্যবহৃত হয়?\nউত্তর: নিরাপত্তা সংক্রান্ত ক্ষেত্রে।",

            "147. মানুষকে বিশেষভাবে চিহ্নিত করার প্রযুক্তি কী?\nউত্তর: বায়োমেট্রিক্স।",

            "148. বায়োমেট্রিক্সের পদ্ধতি কী?\nউত্তর: আঙুলের ছাপ এবং অন্যান্য শারীরিক বৈশিষ্ট্য শনাক্ত করা।",

            "149. তথ্য প্রযুক্তির সাহায্যে মানুষের শারীরিক বৈশিষ্ট্য চিহ্নিত করে তাকে শনাক্তকরণ প্রক্রিয়াকে কী বলা হয়?\nউত্তর: বায়োমেট্রিক্স।",

            "150. কোন প্রযুক্তির সাহায্যে মানুষকে এককভাবে শনাক্ত করা হয়?\nউত্তর: বায়োমেট্রিক্স প্রযুক্তি।",

            "151. বায়োমেট্রিক্সে কোন প্রযুক্তি ব্যবহৃত হয়?\nউত্তর: সেন্সর প্রযুক্তি।",

            "152. জীববিজ্ঞানের সমস্যা সমাধানে কম্পিউটারের সাহায্যে কী ব্যবহার করা হয়?\nউত্তর: বায়োইনফরমেটিক্স।",

            "153. মোবাইল সিম কেনার সময় কোন প্রযুক্তি গ্রাহককে সহায়তা করে?\nউত্তর: বায়োমেট্রিক্স।",

            "154. কম্পিউটারে জীববিজ্ঞানের বিষয় নিয়ে গবেষণা করাকে কী বলা হয়?\nউত্তর: ওয়েটল্যাব গবেষণা।",

            "155. বায়োইনফরমেটিক্সের একটি গুরুত্বপূর্ণ বৈশিষ্ট্য কী?\nউত্তর: জৈবিক ডেটার বিশ্লেষণ।",

            "156. বায়োইনফরমেটিক্সের মূল উদ্দেশ্য কী?\nউত্তর: জীববিজ্ঞানের পদ্ধতি সম্পর্কে সঠিক তথ্য পাওয়া।",

            "157. অদ্বিতীয়ভাবে ব্যক্তিকে শনাক্তকরণের প্রযুক্তি কোনটি?\nউত্তর: বায়োমেট্রিক্স।",

            "158. জিন সম্পর্কিত গবেষণায় কোন প্রযুক্তি ব্যবহৃত হয়?\nউত্তর: বায়োইনফরমেটিক্স।",

            "159. মানুষের শারীরিক বৈশিষ্ট্যগুলোর মধ্যে কী কী গুরুত্বপূর্ণ?\nউত্তর: চোখের মণি, আঙুলের ছাপ, DNA।",

            "160. বায়োমেট্রিক্স সিস্টেমে শনাক্তকরণে ব্যবহৃত শারীরিক বৈশিষ্ট্যগুলির মধ্যে কী কী আছে?\nউত্তর: হাতের আঙ্গুলের আকার, চোখের iris, স্বাক্ষর।",

            "161. বায়োমেট্রিক্স প্রযুক্তি কোথায় ব্যবহৃত হতে পারে?\nউত্তর: জাতীয় পরিচয়পত্র, পাসপোর্ট, জন্ম নিবন্ধনে।",

            "162. বায়োইনফরমেটিক্সের সঙ্গে কোন বিষয়গুলি সম্পর্কিত?\nউত্তর: জীববিজ্ঞান, পরিসংখ্যান, কম্পিউটার বিজ্ঞান।",

            "163. বায়োইনফরমেটিক্সের প্রধান গবেষণার বিষয়গুলি কী কী?\nউত্তর: ইমেজ বিশ্লেষণ, জিন বিশ্লেষণ, ডেটা বিশ্লেষণ।",

            "164. ক্যান্সারের কারণ অনুসন্ধানে কোন পদ্ধতি ব্যবহৃত হয়?\nউত্তর: জেনেটিক ইঞ্জিনিয়ারিং।",

            "165. 'GMO' কী?\nউত্তর: জেনেটিক্যালি পরিবর্তিত জীব।",

            "166. DNA-কে প্রাণীর কোষে কীভাবে প্রবেশ করানো হয়?\nউত্তর: মাইক্রো ইনজেকশন প্রযুক্তি দ্বারা।",

            "167. কোন প্রযুক্তির সাহায্যে বিভিন্ন হরমোন তৈরি করা সম্ভব?\nউত্তর: জেনেটিক ইঞ্জিনিয়ারিং।",

            "168. পাউরুটিতে ব্যবহৃত ইস্ট তৈরি করার জন্য কোন পদ্ধতি ব্যবহৃত হয়?\nউত্তর: জেনেটিক ইঞ্জিনিয়ারিং।",

            "169. জীবদেহে পরিবর্তন আনার জন্য কোন পদ্ধতি ব্যবহার করা হয়?\nউত্তর: জেনেটিক ইঞ্জিনিয়ারিং।",

            "170. জেনেটিক ইঞ্জিনিয়ারিং বাণিজ্যিকভাবে কোথায় ব্যবহৃত হচ্ছে?\nউত্তর: কৃষি খাতে।",
            "171. একটি নির্দিষ্ট জিনের অংশ এক জীব থেকে আলাদা করে অন্য জীবের মধ্যে স্থানান্তরের প্রক্রিয়াকে কী বলা হয়?\nউত্তর: জেনেটিক ইঞ্জিনিয়ারিং।",

            "172. ট্রান্সজেনিক উদ্ভিদ বা প্রাণী তৈরিতে কোন প্রযুক্তি ব্যবহৃত হয়?\nউত্তর: জেনেটিক ইঞ্জিনিয়ারিং।",

            "173. জীবের DNA'র বিভাজিত একক অংশকে কী বলে?\nউত্তর: জিন।",

            "174. যে পদ্ধতিতে একটি জীবের কোষ থেকে অন্য জীবের কোষে DNA স্থানান্তরিত হয়, সেটিকে একত্রে কী বলা হয়?\nউত্তর: রিকম্বিনেন্ট DNA।",

            "175. সাধারণ DNA ছাড়াও ব্যাকটেরিয়ার কোষে অতিরিক্ত যে স্বনিয়ন্ত্রিত বৃত্তাকার DNA থাকে, তাকে কী বলে?\nউত্তর: প্লাজমিড।",

            "176. উচ্চ ফলনশীল শস্য উৎপাদন করতে কোন প্রযুক্তি ব্যবহৃত হয়?\nউত্তর: জেনেটিক ইঞ্জিনিয়ারিং।",

            "177. জেনেটিক ইঞ্জিনিয়ারিং কোথায় ব্যবহার হয়?\nউত্তর: চিকিৎসা ক্ষেত্রে।",

            "178. নতুন ধরনের ক্রোমোজোম তৈরির প্রক্রিয়াকে কী বলা হয়?\nউত্তর: জেনেটিক ইঞ্জিনিয়ারিং।",

            "179. জেনেটিক ইঞ্জিনিয়ারিংয়ের মাধ্যমে কী কী করা সম্ভব?\nউত্তর: নতুন জিনোম তৈরি, ইনসুলিন উৎপাদন, এক জীবের DNA অন্য জীবের মধ্যে স্থানান্তর।",

            "180. রেস্ট্রিকশন এনজাইমের সাহায্যে কী করা সম্ভব?\nউত্তর: DNA কাটা, কোষ থেকে DNA স্থানান্তর, এক জীবের DNA অংশ অন্য জীবের DNA-তে যুক্ত করা।",

            "181. জেনেটিক ইঞ্জিনিয়ারিং সফলভাবে কোন ক্ষেত্রগুলোতে ব্যবহৃত হচ্ছে?\nউত্তর: শিল্প, চিকিৎসা, কৃষি।",

            "182. রিকম্বিনেন্ট DNA প্রযুক্তির ধাপগুলো কী?\nউত্তর: DNA নির্বাচন, বাহক নির্বাচন, DNA কর্তন।",

            "183. BRRI কোন প্রযুক্তি ব্যবহার করে?\nউত্তর: জেনেটিক ইঞ্জিনিয়ারিং।",

            "184. এক ন্যানোমিটার কত মিটার হয়?\nউত্তর: 10<sup>-9</sup> মিটার।",

            "185. আণবিক স্তরে পদার্থের পরিবর্তন ও নিয়ন্ত্রণ করার প্রক্রিয়াকে কী বলা হয়?\nউত্তর: ন্যানোটেকনোলজি।",

            "186. ন্যানোটেকনোলজির প্রবর্তক কে ছিলেন?\nউত্তর: রিচার্ড ফাইনম্যান।",

            "187. ন্যানো শব্দের মানে কী?\nউত্তর: 10<sup>-9</sup>।",

            "188. কোন প্রযুক্তি ব্যবহার করে আমাদের দৈনন্দিন পণ্য ছোট করা সম্ভব?\nউত্তর: সেমিকন্ডাক্টর প্রযুক্তি।",

            "189. ন্যানোটেকনোলজি বা ন্যানো প্রযুক্তি সংক্ষেপে কী বলা হয়?\nউত্তর: ন্যানোটেক।",

            "190. ন্যানো-অবজেক্ট কোথা থেকে তৈরি হয়?\nউত্তর: মলিকুলার উপাদান থেকে।",

            "191. খাদ্যজাত পণ্যের মান বজায় রাখার জন্য প্যাকেটের ভিতরে প্রলেপ করার প্রযুক্তি কী?\nউত্তর: ন্যানোটেকনোলজি।",

            "192. আণবিক স্তরে ধাতব পদার্থের পরিবর্তন ও নিয়ন্ত্রণের প্রযুক্তি কোনটি?\nউত্তর: ন্যানোটেকনোলজি।",

            "193. স্মার্টফোন তৈরির ক্ষুদ্র যন্ত্রাংশের ত্রুটিহীনভাবে স্থাপন সম্ভব হচ্ছে কোন প্রযুক্তির মাধ্যমে?\nউত্তর: ন্যানোটেকনোলজি।",

            "194. ন্যানোটেকনোলজির ব্যবহারিক ক্ষেত্রগুলো কী কী?\nউত্তর: রসায়ন, পদার্থবিজ্ঞান, মেকানিক্যাল ইঞ্জিনিয়ারিং।",

            "195. ন্যানোটেকনোলজি যেসব ক্ষেত্রে বৈপ্লবিক পরিবর্তন আনতে পারে, তা হলো-\nউত্তর: চিকিৎসা, ইলেকট্রনিক্স, শক্তি উৎপাদন।",

            "196. ন্যানোটেকনোলজি দ্বারা তৈরি যন্ত্র হতে পারে-\nউত্তর: কম্পিউটার, ক্রায়োলোব, রোবট।",

            "197. ইন্টারনেটের মাধ্যমে অন্যের কম্পিউটারে অবৈধভাবে প্রবেশ করাকে কী বলা হয়?\nউত্তর: হ্যাকিং।",

            "198. হ্যাকাররা কাদের বলা হয়?\nউত্তর: যারা ইন্টারনেটের মাধ্যমে অবৈধভাবে কম্পিউটারে প্রবেশ করে।",

            "199. কম্পিউটার ইথিকসের নির্দেশিকা কতটি?\nউত্তর: ১০টি।",

            "200. কম্পিউটার অপরাধের মধ্যে কী কী অন্তর্ভুক্ত?\nউত্তর: কপিরাইট লঙ্ঘন, অশ্লীল চিত্র প্রচার, নতুন ব্যাংক একাউন্ট খোলা।",

            "201. হ্যাকাররা কী কী কাজ করে?\nউত্তর: কম্পিউটারের প্রয়োজনীয় ফাইল নষ্ট করা, অনলাইন প্রতারণা, নতুন সফটওয়্যার তৈরি করা।",

            "202. কম্পিউটার অপরাধের অন্তর্ভুক্ত বিষয়গুলো কী?\nউত্তর: সফটওয়্যার পাইরেসি, প্লেজিয়ারিজম, ডেটা চুরি।",

            "203. ফেসবুক পেজ থেকে গল্প তুলে হাসান নিজের নামে মাদ্রাসা ম্যাগাজিনে ছাপিয়ে দিল, এটি কোন ধরনের কাজ?\nউত্তর: প্লেজিয়ারিজম।"

    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        EdgeToEdge.enable(this);
        setContentView(R.layout.activity_16);

        // Get reference to TextView
        @SuppressLint({"MissingInflatedId", "LocalSuppress"}) TextView textView = findViewById(R.id.questionsTextView);

        // Convert the array into a single string with new lines
        StringBuilder questionsText = new StringBuilder();
        for (String question : questions) {
            questionsText.append(question).append("\n\n");
        }

        // Set text to TextView
        textView.setText(questionsText.toString());

        // Handle window insets
        ViewCompat.setOnApplyWindowInsetsListener(findViewById(R.id.main), (v, insets) -> {
            Insets systemBars = insets.getInsets(WindowInsetsCompat.Type.systemBars());
            v.setPadding(systemBars.left, systemBars.top, systemBars.right, systemBars.bottom);
            return insets;
        });
    }
}
